{"convertedBy": "TensorFlow.js Converter v1.0.1", "generatedBy": "keras v2.2.4", "modelTopology": {"model_config": {"class_name": "Model", "config": {"input_layers": [["lstm_1_input", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "lstm_1_input", "config": {"name": "lstm_1_input", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 300]}, "inbound_nodes": []}, {"class_name": "LSTM", "name": "lstm_1", "config": {"recurrent_regularizer": null, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "unroll": false, "trainable": true, "dropout": 0.0, "stateful": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "name": "lstm_1", "activation": "tanh", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, 1, 300], "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": true, "implementation": 1, "units": 300}, "inbound_nodes": [[["lstm_1_input", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_2", "config": {"recurrent_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "unroll": false, "trainable": true, "dropout": 0.0, "stateful": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "name": "lstm_2", "activation": "tanh", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "return_sequences": false, "implementation": 1, "units": 256}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"bias_constraint": null, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "output_layers": [["lstm_1", 0, 0], ["lstm_2", 0, 0], ["dropout_1", 0, 0], ["dense_1", 0, 0]]}}, "backend": "tensorflow", "keras_version": "2.2.4"}, "format": "layers-model", "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [256, 1]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [1]}, {"name": "lstm_1/kernel", "dtype": "float32", "shape": [300, 1200]}, {"name": "lstm_1/recurrent_kernel", "dtype": "float32", "shape": [300, 1200]}, {"name": "lstm_1/bias", "dtype": "float32", "shape": [1200]}, {"name": "lstm_2/kernel", "dtype": "float32", "shape": [300, 1024]}, {"name": "lstm_2/recurrent_kernel", "dtype": "float32", "shape": [256, 1024]}, {"name": "lstm_2/bias", "dtype": "float32", "shape": [1024]}], "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"]}]}
